load-tests/health-check.yml
config:
  target: "http://localhost:3005"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 50
      name: "Peak load"
  
scenarios:
  - name: "Basic Health Check"
    flow:
      - get:
          url: "/health"
      - think: 2
      
  - name: "Detailed Health Check"
    weight: 3
    flow:
      - get:
          url: "/health/detailed"
      - think: 5

  - name: "Readiness Check"
    weight: 1
    flow:
      - get:
          url: "/health/ready"
      - think: 3

  - name: "Liveness Check"
    weight: 1
    flow:
      - get:
          url: "/health/live"
      - think: 1